---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalTopBottomPlanesReversed
source: html/cca0e6de-d91f-dff9-fce9-b8b1d46ff1b0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalTopBottomPlanesReversed Property

Analytical Top Projection Plane is partially or completely below Analytical Bottom Projection Plane. Please reset
 top and/or bottom planes to valid values.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalTopBottomPlanesReversed { get; }
```